ayueha/MSP430withC/miniProject/main.c
//******************************************************************************
/*
 *   Filename:      MSP430 Data Logger v04.c
 *   Date:          2013/01/17
 *   File Version:  1.0
 *
 *   Author:        Nemeti Laszlo
 *   Company:
 *
 *************************************************************************
 *
 *   Architecture:  MSP430
 *   Processor:     MSP430G2553
 *   Compiler:      Code Composer Studio  Version: 5.3.0.00090
 *
 *************************************************************************
 *
 *   Files required: none
 *
 *************************************************************************
 *
 *   Description:
 *
 *      ACLK = n/a, MCLK = SMCLK = CALB_1MHZ, ADC10CLK = ADC10OSC/4
 *
 *
 *      ADC sample is made on A10 with reference to internal
 *              1.5V Vref. Temperature in oC stored in IntDegC.
 *          ADC sample is made on A11 with reference to internal
 *              2.5V Vref. MPS430 power supply voltage is mV stored in
 *              IntVoltmV.
 *      ADC sampling/converting/ is started by
 *          -Timer_A.OUT1 (in every 1 second a Repeat-Single-Channel ADC measuring is started)
 *          -Data Transfer Controller (DTC) is used
 *              -number of transfers for a block = ADC_Buffer_Size
 *              -block start address = (unsigned int)(ADC_Buffer)
 *          -tsample = 64*ADC10CLK = 64*1/(5MHz/4) = 51,2us
 *          -tconvert = 13*ADC10CLK = 10,4us
 *
 *      LED_GRE: Indicates ADC oparation
 *      LED_RED: Indicates Main operation
 *
 *      HW UART TX: is used to send measured data to PC via SERIAL PORT
 *          Baud Rate: 9600 Baud
 *      HW UART RX: is used to receive a char to set ADC_buffer_Size for ADC averaging
 *          received char - ADC_Averaging - UART TX
 *          '0'             none(1X)        ADC_Buffer_Size(=1)
 *          '1'             2X              ADC_Buffer_Size(=2)
 *          '2'             4X              ADC_Buffer_Size(=4)
 *          '3'             8X              ADC_Buffer_Size(=8)
 *          '4'             16X             ADC_Buffer_Size(=16)
 *          '5'             32X             ADC_Buffer_Size(=32)
 *          '9'             -               ADC_Buffer_Size
 *
 *
 *                MSP430G2x33/G2x53
 *             -----------------
 *         /|\|              XIN|-
 *          | |                 |
 *          --|RST          XOUT|-
 *            |                 |
 *            |A10              |
 *
 *
 *******************************************************************************
 The original program is from Nemeti Laszlo
 Update my Ayaka Uehara as course project 2018/12/14
 */

#include  "msp430g2553.h"
#include <stdio.h>

#define LED_RED BIT0                    //LED red variable init bit 0
#define LED_GRE BIT6                    //LED green variable init bit 6
#define MAX_ADC_BUFFER_SIZE 32          //Maximum number of transfers for a block
#define DEFAULT_ADC_BUFFER_SIZE 8       //Default number of transfers for a block

long IntVoltmV; //Voltage info variable
long IntDegC;   //Temperature info variable
char buffer[10];
unsigned int ADC_Buffer_Size = DEFAULT_ADC_BUFFER_SIZE; //8
unsigned int ADC_Buffer[MAX_ADC_BUFFER_SIZE];

volatile char RX_char;        //char info
volatile int temp;            //Temperature information as return value

volatile struct {
    unsigned int RX_Received    :1;  //fifo uart flag
} Flags;

volatile unsigned int msgflg;

//function prototypes
void UART_puts(char * s);                               //function of UART printing
char * outdata(long data,char * unit, char * result);   //
long ADC_Buffer_Sum (void);                             //
void Process_Command(char Command_char);                //
int volatgecalc();                                      //return voltage information function
int tempcalc();                                         //return temperature information function

void main(void) {

    WDTCTL = WDTPW + WDTHOLD;                 // Stop WDT

    //Initialize DCO
    if (CALBC1_1MHZ ==0xFF || CALDCO_1MHZ == 0xFF)
    {
        while(1);                               // If calibration constants erased
        // do not load, trap CPU!!
    }
    BCSCTL1 = CALBC1_1MHZ;                    // Set DCO
    DCOCTL = CALDCO_1MHZ;

    //Initialize ADC
    ADC10CTL1 = INCH_10 + ADC10DIV_3 + SHS_1 + CONSEQ_2;                // Temp Sensor, ADC10CLK div: /4, S/H source: Timer_A.OUT1, Repeat-single-channel
    ADC10CTL0 = SREF_1 + ADC10SHT_3 + MSC + REFON + ADC10ON + ADC10IE;  //S/H 64*ADC10CLKs, ADC10CLK source: ADC10OSC ~5NHz
    TACCR0 = 30;                              // Delay to allow Ref to settle
    TACCTL0 |= CCIE;                          // Compare-mode interrupt
    TACTL = TASSEL_2 + MC_1;                  // TACLK = SMCLK, Up mode
    __bis_SR_register(CPUOFF + GIE);          // LPM0, TA0_ISR will force exit
    TACCTL0 &= ~CCIE;                         // Disable timer Interrupt

    //Configure Timer_A.OUT1     ~PWM: 1Hz / 50% duty cycle /
    BCSCTL3 |= LFXT1S_2;                        // ACLK = VLO
    TACCR0 = 12000;                             //
    TACCTL1 = OUTMOD_3;                         // TACCR1 set/reset
    TACCR1 = 6000;                              // TACCR1 PWM Duty Cycle
    TACTL = TASSEL_1 + MC_1;                    // TACLK = ACLK, Up mode

    //Initialize HW UART
    P1SEL = BIT1 + BIT2 ;                       // P1.1 = RXD, P1.2=TXD
    P1SEL2 = BIT1 + BIT2;                       // Secondary peripheral module function is selected.
    UCA0CTL1 |= UCSSEL_2;                       // SMCLK
    UCA0BR0 = 104;                              // 1MHz 9600
    UCA0BR1 = 0;                                // 1MHz 9600
    UCA0MCTL = UCBRS0;                          // Modulation UCBRSx = 1
    UCA0CTL1 &= ~UCSWRST;                       // **Initialize USCI state machine**
    IE2 |= UCA0RXIE;                            // Enable USCI_A0 RX interrupt

    //Initialize LED_RED LED_GRE
    P1DIR |= LED_RED;                           // Direction: output
    P1DIR |= LED_GRE;

    ADC10DTC1 = ADC_Buffer_Size;                //set Buffer size of voltage and Temperature
    ADC10SA = (unsigned int)(ADC_Buffer);       //block start address, cast information to "unsigend int".
    ADC10CTL0 |= ENC+ ADC10SC;                  //ENC = enable conversion, ADC10SC = start conversion ***add


    TACCTL1 |= CCIE;                            // Compare-mode interrupt


    //Welcome message of the program
    UART_puts("MSP430 mini project. Start program, enter [s] \r\n");

    while(1) {
        __bis_SR_register(CPUOFF + GIE);        // LPM0 with interrupts enabled

       //if a micro-controller received a letter from UART
       if (Flags.RX_Received) {
            P1OUT |= LED_RED;                       //if UART info has been inputed from key board
            Flags.RX_Received = 0;                  //Clear Flag
               Process_Command(RX_char);            //UART show info , depending on user inputs,
        }

        ADC10SA = (unsigned int)(ADC_Buffer);
        ADC10CTL0 |= ENC+ADC10SC;
        P1OUT &= ~(LED_RED);

    }

}

//-------------------------------------------------
// function definitions
//-------------------------------------------------
void Process_Command(char Command_char){

    if (Command_char == 'v' && msgflg==1){

             UART_puts("Voltage information has been choosed \r\n");
             IntVoltmV = volatgecalc();
             UART_puts( outdata(IntVoltmV,"mV\r\n",buffer));

        }else if (Command_char == 't' && msgflg==1){

            UART_puts("Temperature information has been choosed \r\n");
            temp = ADC10MEM;
            IntDegC = tempcalc();
            UART_puts( outdata(IntDegC,"C\r\n",buffer));

        }else if (Command_char == 'b' && msgflg==1){

            UART_puts("Voltage and temperature information has been choosed \r\n");
            temp = ADC10MEM;
            IntVoltmV = volatgecalc();
            IntDegC = tempcalc();
            UART_puts( outdata(IntVoltmV,"mV\r\n",buffer));
            UART_puts( outdata(IntDegC,"C\r\n",buffer));

        }else if (Command_char == 's' && msgflg==0){
               UART_puts("Start a program ! \r\n");
               UART_puts("Press [v] to show voltage\r\n");
               UART_puts("Press [t] to show temperature\r\n");
               UART_puts("Press [b] to show both voltage and temperature\r\n");
               msgflg=1;
       }else {
           UART_puts("Invalid command \r\n");
  }
}




long ADC_Buffer_Sum(void){
    long Sum = 0;
    unsigned int i;
    for(i = 0; i < ADC_Buffer_Size; i++){
        Sum += ADC_Buffer[i];
    }
    return Sum;
}

void UART_puts(char * s) {
    while (*s) {
        while (!(IFG2&UCA0TXIFG));                // USCI_A0 TX buffer ready?
        UCA0TXBUF = *s++;
    }
}

char * outdata(long data,char * unit, char * result ){
    char * ptr_r = result;
    char * ptr_u = unit;
    char * ptr_temp;
    long temp = data;

    if (data < 0) {
        *ptr_r++ = '-';
        data = -data;
    }

    do {
        ++ptr_r;
        temp = temp/10;
    } while (temp);
    ptr_temp = ptr_r;

    do{
        *--ptr_r = data % 10 + '0';
    }while((data /= 10));

    ptr_r = ptr_temp;
    while (*ptr_r++ = *ptr_u++);

    return result;
}

int volatgecalc(){
    return ADC_Buffer_Sum() * 5000 / 1024 / ADC_Buffer_Size;
}


int tempcalc(){
    return (int) ((temp * 27069L - 18169625L) >> 16);    //bit shift
}


// ADC10 interrupt service routine
#pragma vector=ADC10_VECTOR
__interrupt void ADC10_ISR(void)
{
    ADC10CTL0 &= ~ENC;                      // ADC10 disable
    while (ADC10CTL1 & BUSY);

    P1OUT &= ~(LED_GRE);                    // Turn LED off
    __bic_SR_register_on_exit(CPUOFF);      // Clear CPUOFF bit from 0(SR)
}

#pragma vector=TIMER0_A0_VECTOR
__interrupt void TA0_ISR(void)
{
    __bic_SR_register_on_exit(CPUOFF);        // Clear CPUOFF bit from 0(SR)
}

#pragma vector=TIMER0_A1_VECTOR                 /// Timer0 A CC1-2, TA
__interrupt void TA0_1_ISR(void)
{
    switch (__even_in_range(TAIV, 10))        // Efficient switch-implementation
    {
    case  2:                                // TACCR1
        P1OUT |= LED_GRE;
        break;
    case  4: break;                         // TACCR2 not used
    case 10: break;                         // Overflow not used
    }

}

#pragma vector=USCIAB0RX_VECTOR
__interrupt void USCI0RX_ISR(void)
{
    RX_char = UCA0RXBUF;
    Flags.RX_Received = 1;
}

